/////////////////////////////////
///
///フォーマット表示4(表示指定)
/// 
//////////////////////////////////

/// . メイン関数

fn main() {
   
    //変数セット
    let ku1="この味が";
    let ku2="いいねと君が";
    let ku3="言ったから";
    let ku4="七月六日は";
    let ku5="サラダ記念日";
    
    //標示
    println!("{}{}{}{}{} {auth}",ku1,ku2,ku3,ku4,ku5,auth="俵万智");
    println!("{3}{4}{}{}{} {auth}",ku1,ku2,ku3,ku4,ku5,auth="逆さま小僧");
    println!("{1}{2}{}{hennka1}{hennka2} {auth}",ku1,ku4,ku5,auth="サザナミインコ",hennka1="僕のひとよの",hennka2="塩梅とする");
    }
    